tap "dotenv-org/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "lyraphase/pcloud"
tap "spicetify/tap"
tap "yqrashawn/goku"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Download with resuming and segmented downloading
brew "aria2"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for USB device access
brew "libusb"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Manage compile and link flags for libraries
brew "pkg-config"
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Rust toolchain installer
brew "rustup-init"
# Programmatically correct mistyped console commands
brew "thefuck"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# UNIX shell (command interpreter)
brew "zsh"
# Sync .env files
brew "dotenv-org/brew/dotenv-vault"
# Application launcher and productivity software
cask "alfred"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Application uninstaller
cask "appcleaner"
# Web browser focusing on privacy
cask "brave-browser"
# Bittorrent client
cask "c0re100-qbittorrent"
# E-books management software
cask "calibre"
# App to build and share containerized applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# YouTube player focusing on privacy
cask "freetube"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# File system integration
cask "macfuse"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# File manager
cask "path-finder"
# Client for the pCloud virtual cloud storage service
cask "pcloud-drive"
# VPN client focusing on security
cask "protonvpn"
# Instant messaging application focusing on security
cask "signal"
# Knowledge management for organizations
cask "slab"
# Customize mouse buttons, wheels and cursor speed
cask "steermouse"
# Open-source media center
cask "stremio"
# Native GUI tool for relational databases
cask "tableplus"
# Unpacks archive files
cask "the-unarchiver"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
vscode "aaron-bond.better-comments"
vscode "af4jm.vscode-icalendar"
vscode "ajmnz.prisma-import"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "antfu.unocss"
vscode "artdiniz.quitcontrol-vscode"
vscode "astro-build.astro-vscode"
vscode "BattleBas.kivy-vscode"
vscode "BeardedBear.beardedtheme"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "darkriszty.markdown-table-prettify"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "fabiospampinato.vscode-diff"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hediet.vscode-drawio"
vscode "IronGeek.vscode-env"
vscode "jgclark.vscode-todo-highlight"
vscode "jock.svg"
vscode "kavish.hex-to-hsl"
vscode "liviuschera.noctis"
vscode "LuqueDaniel.languague-renpy"
vscode "meganrogge.template-string-converter"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikeburgh.xml-format"
vscode "mikestead.dotenv"
vscode "mikoz.autoflake-extension"
vscode "mrmlnc.vscode-scss"
vscode "mrorz.language-gettext"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "ryuta46.multi-command"
vscode "samundrak.esdoc-mdn"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "stackbreak.comment-divider"
vscode "stkb.rewrap"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tomoki1207.pdf"
vscode "Tyriar.sort-lines"
vscode "vscodevim.vim"
vscode "xshrim.txt-syntax"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zengxingxin.sort-js-object-keys"
vscode "zxh404.vscode-proto3"
