# This is a comment
# You can add comments using the '#' symbol

# Install packages using Homebrew
brew "diff-so-fancy"
brew "fzf"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "jq"
brew "neovim"
brew "nvm"
brew "poetry"
brew "pyenv"
brew "rustup-init"
brew "thefuck"
brew "zsh"

# DEvops
brew "argocd"
brew "helm"
brew "dnsmasq"
brew "docker"
brew "docker-completion"
brew "dotenv-vault"

# Install Casks (graphical applications) using Homebrew Cask
cask "alfred"
cask "anytype"
cask "appcleaner"
cask "brave-browser"
cask "c0re100-qbittorrent"
cask "calibre"
cask "docker"
cask "drawio"
cask "freetube"
# cask "wacom-tablet" # Re-install if using the drawing tablet
cask "iina"
cask "iterm2"
cask "lulu"
cask "macfuse"
cask "nextcloud"
cask "notunes"
cask "onyx"
cask "path-finder"
cask "pcloud-drive"
cask "protonvpn"
cask "signal"
cask "slab"
cask "steermouse"
cask "stremio"
cask "tableplus"
cask "the-unarchiver"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
